socialNetwork/wrk2/client-external/istio-disabled/read-timeline-without-istio/rps_200.txt
Running 1m test @ http://128.199.25.250:31111/wrk2-api/home-timeline/read
  2 threads and 100 connections
  Thread calibration: mean lat.: 38.095ms, rate sampling interval: 104ms
  Thread calibration: mean lat.: 36.384ms, rate sampling interval: 100ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.87ms   37.85ms 264.19ms   96.92%
    Req/Sec   100.44    160.78   500.00     80.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   25.34ms
 75.000%   34.85ms
 90.000%   45.95ms
 99.000%  264.19ms
 99.900%  282.37ms
 99.990%  314.88ms
 99.999%  315.14ms
100.000%  315.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.831     0.000000            1         1.00
      16.431     0.100000          999         1.11
      18.735     0.200000         2000         1.25
      20.815     0.300000         2998         1.43
      22.879     0.400000         4006         1.67
      25.343     0.500000         4994         2.00
      26.943     0.550000         5503         2.22
      28.607     0.600000         5993         2.50
      30.543     0.650000         6496         2.86
      32.351     0.700000         6994         3.33
      34.847     0.750000         7493         4.00
      36.383     0.775000         7741         4.44
      38.111     0.800000         7996         5.00
      39.935     0.825000         8241         5.71
      41.791     0.850000         8491         6.67
      43.615     0.875000         8743         8.00
      44.639     0.887500         8868         8.89
      46.015     0.900000         8991        10.00
      48.287     0.912500         9115        11.43
      50.719     0.925000         9239        13.33
      53.887     0.937500         9364        16.00
      55.775     0.943750         9427        17.78
      57.087     0.950000         9489        20.00
      59.615     0.956250         9554        22.86
      63.487     0.962500         9614        26.67
      71.231     0.968750         9676        32.00
      76.031     0.971875         9708        35.56
     108.671     0.975000         9739        40.00
     249.727     0.978125         9770        45.71
     252.287     0.981250         9804        53.33
     254.975     0.984375         9832        64.00
     257.407     0.985938         9848        71.11
     259.711     0.987500         9864        80.00
     262.399     0.989062         9880        91.43
     265.215     0.990625         9895       106.67
     267.007     0.992188         9910       128.00
     268.543     0.992969         9918       142.22
     269.311     0.993750         9926       160.00
     270.847     0.994531         9934       182.86
     271.615     0.995313         9942       213.33
     273.151     0.996094         9949       256.00
     274.175     0.996484         9953       284.44
     275.199     0.996875         9957       320.00
     279.807     0.997266         9961       365.71
     281.087     0.997656         9965       426.67
     281.599     0.998047         9971       512.00
     281.599     0.998242         9971       568.89
     281.855     0.998437         9974       640.00
     282.111     0.998633         9976       731.43
     282.367     0.998828         9979       853.33
     282.367     0.999023         9979      1024.00
     282.623     0.999121         9980      1137.78
     282.879     0.999219         9981      1280.00
     283.135     0.999316         9982      1462.86
     283.647     0.999414         9984      1706.67
     283.647     0.999512         9984      2048.00
     283.647     0.999561         9984      2275.56
     284.415     0.999609         9985      2560.00
     284.415     0.999658         9985      2925.71
     284.671     0.999707         9986      3413.33
     284.671     0.999756         9986      4096.00
     284.671     0.999780         9986      4551.11
     314.879     0.999805         9987      5120.00
     314.879     0.999829         9987      5851.43
     314.879     0.999854         9987      6826.67
     314.879     0.999878         9987      8192.00
     314.879     0.999890         9987      9102.22
     315.135     0.999902         9988     10240.00
     315.135     1.000000         9988          inf
#[Mean    =       33.869, StdDeviation   =       37.854]
#[Max     =      314.880, Total count    =         9988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11902 requests in 1.00m, 2.26MB read
Requests/sec:    198.32
Transfer/sec:     38.54KB